### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.onp_cluster_resources.kubernetes_namespace.minio will be created
+   resource "kubernetes_namespace" "minio" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "minio"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.onp_cluster_resources.kubernetes_secret.minio_root_user will be created
+   resource "kubernetes_secret" "minio_root_user" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "minio-root-user"
+           namespace        = "minio"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>